ЛИС2/src/Catalogs/ЛицензионныеУчастки/ЛицензионныеУчастки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЛицензионныеУчастки</name>
  <attributes>
    <name>ЛицензионныйУчасток</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлощадьЛицензионногоУчастка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоРасположенияЛицензионногоУчастка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БалансЗапасовПНГ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРазработки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>АдминистративныеРайоны</name>
    <attributes>
      <name>АдминистративныйРайонПроведенияРабот</name>
      <type>
        <types>CatalogRef.ОКАТО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЛИС2/src/Catalogs/ЛицензионныеУчастки/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;		

КонецПроцедуры // Процедура ПриЗаписи(Отказ)

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток,
		|	ЛицензионныеУчастки.Организация
		|ИЗ
		|	Справочник.ЛицензионныеУчастки КАК ЛицензионныеУчастки
		|ГДЕ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток = &НомерУчастка
		|	И ЛицензионныеУчастки.Организация = &Организация";
		
		Запрос.УстановитьПараметр("НомерУчастка", ЭтотОбъект.ЛицензионныйУчасток);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Пара полей ""Лицензионный участок"" и ""Организация"" не уникальна!'");
			Сообщение.Сообщить();
			
			Отказ = Истина;
			
		КонецЕсли;
		
	Иначе	
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток,
		|	ЛицензионныеУчастки.Организация
		|ИЗ
		|	Справочник.ЛицензионныеУчастки КАК ЛицензионныеУчастки
		|ГДЕ
		|	ЛицензионныеУчастки.ЛицензионныйУчасток = &НомерУчастка
		|	И ЛицензионныеУчастки.Организация = &Организация
		|	И НЕ ЛицензионныеУчастки.Ссылка = &Объект";
		
		Запрос.УстановитьПараметр("НомерУчастка", ЭтотОбъект.ЛицензионныйУчасток);
		Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
		Запрос.УстановитьПараметр("Объект", Этотобъект.Ссылка);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = НСтр("ru = 'Пара полей ""Лицензионный участок"" и ""Организация"" не уникальна!'");
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();

			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЕсли;    
	
КонецПроцедуры


#КонецОбласти

#КонецЕсли
